Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/СпособВыбораОтветственногоЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособВыбораОтветственногоЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзСотрудниковУчреждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзСотрудниковЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзСотрудниковУчрежденияИЦБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СтатусыЧленовКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЧленовКомиссии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Председатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаместительПредседателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченноеПредседателемЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эксперт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаместительУполномоченногоПредседателемЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ПостоянноДействующиеКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПостоянноДействующиеКомиссии</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кворум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйПроцентЗа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьГолосПредседателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНеактуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризационная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРабочейКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЧленаКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЧленовКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйИсполнитель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредседатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУполномоченноеЛицо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Сотрудники/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Если НЕ ТипЗнч(Параметры.Отбор.Владелец) = Тип("СправочникСсылка.Организации") Тогда
			Параметры.Отбор.Удалить("Владелец");
		Иначе
			Параметры.Отбор.Владелец = Справочники.Организации.ПереопределитьОтборПоОрганизации(Параметры.Отбор.Владелец);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.СотрудникиТекущегоПользователя Тогда
		Параметры.Отбор.Вставить("Ссылка", Новый ФиксированныйМассив(
			ОбщегоНазначенияБГУ.СотрудникиПоПользователю()));
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
			"Период", Параметры.Период, Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ЦентрализованнаяБухгалтерия") 
		И ПолучитьФункциональнуюОпцию("ИспользоватьЦентрализованнуюБухгалтерию") Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.ЦентрализованнаяБухгалтерия) Тогда
			Параметры.ЦентрализованнаяБухгалтерия = Константы.ОрганизацияЦентрализованнаяБухгалтерия.Получить(); 
		КонецЕсли;	
		Если  Параметры.Свойство("СпособВыбора")
			И Параметры.Отбор.Свойство("Владелец")
			И Параметры.Отбор.Владелец <> Параметры.ЦентрализованнаяБухгалтерия Тогда
			Если Параметры.СпособВыбора = ПредопределенноеЗначение("Перечисление.СпособВыбораОтветственногоЦБ.ИзСотрудниковЦБ") Тогда
				Параметры.Отбор.Вставить("Владелец", Параметры.ЦентрализованнаяБухгалтерия);
			ИначеЕсли Параметры.СпособВыбора = ПредопределенноеЗначение("Перечисление.СпособВыбораОтветственногоЦБ.ИзСотрудниковУчрежденияИЦБ") Тогда
				СписокОрганизаций = Новый СписокЗначений;
				СписокОрганизаций.Добавить(Параметры.Отбор.Владелец);
				СписокОрганизаций.Добавить(Параметры.ЦентрализованнаяБухгалтерия);
				Параметры.Отбор.Вставить("Владелец",СписокОрганизаций);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Если ТипЗнч(Параметры.Отбор.Владелец) = Тип("СписокЗначений") Тогда
			РасширениеЗаголовка = СтрСоединить(Параметры.Отбор.Владелец.ВыгрузитьЗначения(), "; ");	
		Иначе
			РасширениеЗаголовка = Строка(Параметры.Отбор.Владелец)
		КонецЕсли;
		
		Заголовок = РасширениеЗаголовка;
	КонецЕсли;
	
	ТребуемыеДанные = Параметры.ТребуемыеДанные;
	
	Если Параметры.Отбор.Свойство("Владелец")
			И (ТипЗнч(Параметры.Отбор.Владелец) <> Тип("СписокЗначений")
			Или Параметры.Отбор.Владелец.Количество() = 1) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Владелец",
			"Видимость", Ложь);
	КонецЕсли;
	
	НастроитьЭлементыКомиссии();
	
	УстановитьУсловноеОформление();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КомандыФормы);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	ПрименитьОтборПоКомиссии = ЗначениеЗаполнено(ОтборКомиссия);
	
	ОтборНомерРабочейКомиссии = 0;
	ПрименитьОтборПоРабочейКомиссии = Ложь;
	
	НастроитьЭлементыПоСвойствамКомиссии();
	
	УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерРабочейКомиссииПриИзменении(Элемент)
	
	ПрименитьОтборПоРабочейКомиссии = ЗначениеЗаполнено(ОтборНомерРабочейКомиссии);
	
	УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйИсполнительПриИзменении(Элемент)
	
	ПрименитьОтборПоОтветственномуИсполнителю = Истина;
	
	УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыбор(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОбработатьВыбор(СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ДобавитьУсловноеОформлениеПредседателя();
	
	ДобавитьУсловноеОформлениеУполномоченногоПредседателемЛица();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеПредседателя()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Выделение председателя комиссии'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусЧленаКомиссии");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Перечисления.СтатусыЧленовКомиссии.Председатель;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СтатусЧленаКомиссии");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеУполномоченногоПредседателемЛица()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Выделение уполномоченного председателем лица'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусЧленаКомиссии");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Перечисления.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СтатусЧленаКомиссии");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыКомиссии()
	
	Параметры.Свойство("Комиссия", ОтборКомиссия);
	
	Если Не ЗначениеЗаполнено(ОтборКомиссия) Тогда
		ПрименитьОтборПоКомиссии = Ложь;
		ПрименитьОтборПоРабочейКомиссии = Ложь;
		
		УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
		
		// Отключаем видимость всех полей, связанных с отбором по комиссии.
		ПоляКомиссии = Новый Массив();
		ПоляКомиссии.Добавить("ПрименитьОтборПоКомиссии");
		ПоляКомиссии.Добавить("ОтборКомиссия");
		ПоляКомиссии.Добавить("ПрименитьОтборПоРабочейКомиссии");
		ПоляКомиссии.Добавить("ОтборНомерРабочейКомиссии");
		ПоляКомиссии.Добавить("ПрименитьОтборПоОтветственномуИсполнителю");
		ПоляКомиссии.Добавить("ОтборОтветственныйИсполнитель");
		ПоляКомиссии.Добавить("ОтветственныйИсполнитель");
		ПоляКомиссии.Добавить("СтатусЧленаКомиссии");
		ПоляКомиссии.Добавить("НомерРабочейКомиссии");
		ПоляКомиссии.Добавить("ГруппаОтсутствуетПравоЧтения");
		
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ПоляКомиссии, "Видимость", Ложь);
			
		Возврат;
	КонецЕсли;
	
	ЕстьПравоЧтенияКомиссий = ПравоДоступа("Чтение", Метаданные.Справочники.ПостоянноДействующиеКомиссии);
	
	ПереданПараметрНомерРабочейКомиссии = Параметры.Свойство("НомерРабочейКомиссии");
	
	Если ПереданПараметрНомерРабочейКомиссии Тогда
		ОтборНомерРабочейКомиссии = Параметры.НомерРабочейКомиссии;
	Иначе
		ОтборНомерРабочейКомиссии = 0;
	КонецЕсли;
	
	ПереданПараметрОтветственныйИсполнитель = Параметры.Свойство("ОтветственныйИсполнитель");
	
	Если ПереданПараметрОтветственныйИсполнитель Тогда
		ОтборОтветственныйИсполнитель = Параметры.ОтветственныйИсполнитель;
	Иначе
		ОтборОтветственныйИсполнитель = Ложь;
	КонецЕсли;
	
	ПрименитьОтборПоКомиссии = ЗначениеЗаполнено(ОтборКомиссия);
	ПрименитьОтборПоРабочейКомиссии = ПрименитьОтборПоКомиссии И ЗначениеЗаполнено(ОтборНомерРабочейКомиссии);
	ПрименитьОтборПоОтветственномуИсполнителю = ПрименитьОтборПоКомиссии И ПереданПараметрОтветственныйИсполнитель;
	
	Если СписокОрганизаций.Количество() > 0 Тогда
		ЗначениеОтбора = СписокОрганизаций;
	ИначеЕсли Параметры.Отбор.Свойство("Владелец") Тогда
		ЗначениеОтбора = Новый СписокЗначений();
		ЗначениеОтбора.Добавить(Параметры.Отбор.Владелец);
	Иначе
		ЗначениеОтбора = Неопределено;
	КонецЕсли;
	
	Если ЗначениеОтбора <> Неопределено Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ЗначениеОтбора);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ОтборКомиссия.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
	СведенияКомиссии = Неопределено;
	
	НастроитьЭлементыПоСвойствамКомиссии(СведенияКомиссии);
	
	УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
	
	ПоляКомиссии = Новый Массив();
	ПоляКомиссии.Добавить("ПрименитьОтборПоКомиссии");
	ПоляКомиссии.Добавить("ОтборКомиссия");
	ПоляКомиссии.Добавить("ОтветственныйИсполнитель");
	ПоляКомиссии.Добавить("СтатусЧленаКомиссии");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ПоляКомиссии, "Видимость", ЕстьПравоЧтенияКомиссий);
		
	Элементы.ГруппаОтсутствуетПравоЧтения.Видимость = Не ЕстьПравоЧтенияКомиссий;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор(СтандартнаяОбработка)

	Если Не ПустаяСтрока(ТребуемыеДанные) Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные.ЭтоГруппа Тогда
			Возврат;
		КонецЕслИ;
		СтандартнаяОбработка = Ложь;
		ЗначениеСвойства = Неопределено;
		МассивТребуемыхДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ТребуемыеДанные, ",");
		Результат = Новый Структура("Ссылка", ТекущиеДанные.Ссылка);
		Для каждого ТекТребуемыеДанные Из МассивТребуемыхДанных Цикл
			
			ТекущиеДанные.Свойство(ТекТребуемыеДанные, ЗначениеСвойства);
			Результат.Вставить(ТекТребуемыеДанные, ЗначениеСвойства);
			
		КонецЦикла;
		ОповеститьОвыборе(Результат);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОтборПоКомиссииПриИзменении(Элемент)
	
	Если Не ПрименитьОтборПоКомиссии Тогда
		ОтборКомиссия = Неопределено;
		ОтборНомерРабочейКомиссии = 0;
		ПрименитьОтборПоРабочейКомиссии = Ложь;
	КонецЕсли;
	
	НастроитьЭлементыПоСвойствамКомиссии();
	
	УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОтборПоРабочейКомиссииПриИзменении(Элемент)
	
	Если Не ПрименитьОтборПоРабочейКомиссии Тогда
		ОтборНомерРабочейКомиссии = Неопределено;
	КонецЕсли;
	
	УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОтборПоОтветственномуИсполнителюПриИзменении(Элемент)
	
	УстановитьПараметрыОтбораПоКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыПоСвойствамКомиссии(СведенияКомиссии = Неопределено)
	
	Если СведенияКомиссии = Неопределено Тогда
		СведенияКомиссии = ПрочитатьСведенияКомиссии();
	КонецЕсли;
	
	НастроитьЭлементыНомерРабочейКомиссии(СведенияКомиссии.НомераРабочихКомиссий);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыНомерРабочейКомиссии(НомераРабочихКомиссий)
	
	ЗаполнитьСписокВыбораНомерРабочейКомиссии(НомераРабочихКомиссий);
	
	Если НомераРабочихКомиссий = Неопределено Тогда
		ЕстьЗаполненныйНомерРабочейКомиссии = Ложь;
		
	ИначеЕсли НомераРабочихКомиссий.Количество() > 1 Тогда
		ЕстьЗаполненныйНомерРабочейКомиссии = Истина;
		
	ИначеЕсли НомераРабочихКомиссий.Количество() = 1 Тогда
		ЕстьЗаполненныйНомерРабочейКомиссии = (НомераРабочихКомиссий[0] <> 0);
		
	Иначе
		ЕстьЗаполненныйНомерРабочейКомиссии = Ложь;
	КонецЕсли;
	
	// Элементы отбора в шапке и колонка списка.
	ПоляРабочейКомиссии = Новый Массив();
	ПоляРабочейКомиссии.Добавить("ПрименитьОтборПоРабочейКомиссии");
	ПоляРабочейКомиссии.Добавить("ОтборНомерРабочейКомиссии");
	ПоляРабочейКомиссии.Добавить("НомерРабочейКомиссии");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ПоляРабочейКомиссии, "Видимость", ЕстьПравоЧтенияКомиссий И ПереданПараметрНомерРабочейКомиссии И ЕстьЗаполненныйНомерРабочейКомиссии);
	
	// Отбор в шапке заблокирован при передаче номера рабочей комиссии.
	ПоляОтбораРабочейКомиссии = Новый Массив();
	ПоляОтбораРабочейКомиссии.Добавить("ПрименитьОтборПоРабочейКомиссии");
	ПоляОтбораРабочейКомиссии.Добавить("ОтборНомерРабочейКомиссии");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ПоляОтбораРабочейКомиссии, "ТолькоПросмотр", ПереданПараметрНомерРабочейКомиссии И ЗначениеЗаполнено(ОтборНомерРабочейКомиссии));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораНомерРабочейКомиссии(НомераРабочихКомиссий)
	
	Элементы.ОтборНомерРабочейКомиссии.СписокВыбора.Очистить();
	
	Если Не ПереданПараметрНомерРабочейКомиссии Или НомераРабочихКомиссий = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НомерРабочейКомиссии Из НомераРабочихКомиссий Цикл
		Представление = ?(ЗначениеЗаполнено(НомерРабочейКомиссии), Неопределено, НСтр("ru='отсутствует'"));
		
		Элементы.ОтборНомерРабочейКомиссии.СписокВыбора.Добавить(НомерРабочейКомиссии, Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьСведенияКомиссии()
	
	СведенияКомиссии = Новый Структура("НомераРабочихКомиссий,КоличествоОтветственныхИсполнителей");
	
	Если Не ЕстьПравоЧтенияКомиссий Или Не ЗначениеЗаполнено(ОтборКомиссия) Тогда
		Возврат СведенияКомиссии;
	КонецЕсли;
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Комиссия", ОтборКомиссия);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НомерРабочейКомиссии
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии
	|ГДЕ
	|	Ссылка = &Комиссия
	|УПОРЯДОЧИТЬ ПО
	|	НомерРабочейКомиссии
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НомерСтроки
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии
	|ГДЕ
	|	Ссылка = &Комиссия
	|	И ОтветственныйИсполнитель";
	
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	
	СведенияКомиссии.НомераРабочихКомиссий					= РезультатыЗапроса[0].Выгрузить().ВыгрузитьКолонку("НомерРабочейКомиссии");
	СведенияКомиссии.КоличествоОтветственныхИсполнителей	= РезультатыЗапроса[1].Выгрузить().Количество();
	
	Возврат СведенияКомиссии;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыОтбораПоКомиссии(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "Комиссия", Форма.ОтборКомиссия);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "НомерРабочейКомиссии", Форма.ОтборНомерРабочейКомиссии);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "ОтветственныйИсполнитель", Форма.ОтборОтветственныйИсполнитель);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "ПрименитьОтборПоКомиссии", Форма.ПрименитьОтборПоКомиссии И Форма.ЕстьПравоЧтенияКомиссий);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "ПрименитьОтборПоРабочейКомиссии", Форма.ПрименитьОтборПоРабочейКомиссии И Форма.ЕстьПравоЧтенияКомиссий И Форма.ПереданПараметрНомерРабочейКомиссии);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "ПрименитьОтборПоОтветственномуИсполнителю", Форма.ПрименитьОтборПоОтветственномуИсполнителю И Форма.ЕстьПравоЧтенияКомиссий);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти
